# SchemaCommon Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SchemaCommon Class
Members See Also
---
A static class that provides access to the property names that appear in all the visual Asset types.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static class SchemaCommon
```

Visual Basic
---
```text
Public NotInheritable Class SchemaCommon
```

Visual C++
---
```text
public ref class SchemaCommon abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Visual..::..SchemaCommon
# See Also
SchemaCommon Members
Autodesk.Revit.DB.Visual Namespace